Revit 2027 API
ParameterTypeId.StairsSupporttypeTotalDepth Property
 "Total Depth": Total Depth
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsSupporttypeTotalDepth { get; }
Public Shared ReadOnly Property StairsSupporttypeTotalDepth As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsSupporttypeTotalDepth {
	ForgeTypeId^ get ();
}
static member StairsSupporttypeTotalDepth : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace